In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(9).reshape(3,3))

In [3]:
df

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
0    3 non-null int32
1    3 non-null int32
2    3 non-null int32
dtypes: int32(3)
memory usage: 116.0 bytes

In [5]:
df = pd.DataFrame(np.arange(9).reshape(3,3), columns=list("ABC"))

In [6]:
df

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [7]:
df['A']

0    0
1    3
2    6
Name: A, dtype: int32

In [8]:
df[['A','C']]

   A  C
0  0  2
1  3  5
2  6  8

In [9]:
df['A'][1]

3

In [10]:
df.A  # Not recom.

0    0
1    3
2    6
Name: A, dtype: int32

In [11]:
df[:2]['A']

0    0
1    3
Name: A, dtype: int32

In [12]:
df[:1][:]

   A  B  C
0  0  1  2

In [13]:
sales = pd.read_csv('sales.txt')

In [14]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [15]:
sales.describe()

          Units
count   8.00000
mean   15.62500
std    12.78322
min     4.00000
25%     8.50000
50%    11.50000
75%    18.00000
max    40.00000

In [16]:
sales.describe(include='all')

       Month  Book City     Units
count      9     9    8   8.00000
unique     3     2    2       NaN
top      MAR  B100  HYD       NaN
freq       3     6    4       NaN
mean     NaN   NaN  NaN  15.62500
std      NaN   NaN  NaN  12.78322
min      NaN   NaN  NaN   4.00000
25%      NaN   NaN  NaN   8.50000
50%      NaN   NaN  NaN  11.50000
75%      NaN   NaN  NaN  18.00000
max      NaN   NaN  NaN  40.00000

In [17]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [18]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [19]:
sales.loc[0,'Units']

10.0

In [20]:
sales.head()

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0

In [21]:
sales.loc[ sales.City == 'VZG' , ['Book','Units'] ]

   Book  Units
0  B100   10.0
1  B100    4.0
2  B100   13.0
6  B200   14.0

In [22]:
units = sales.loc[ : , 'Units']

In [23]:
type(units)

pandas.core.series.Series

In [24]:
det = sales.loc[ : , ['Book','Units']]

In [25]:
type(det)

pandas.core.frame.DataFrame

In [26]:
sales.index

RangeIndex(start=0, stop=9, step=1)

In [27]:
sales.iloc[0,:]

Month     JAN
Book     B100
City      VZG
Units      10
Name: 0, dtype: object

## Read data about countries

In [28]:
import requests

In [29]:
resp = requests.get("https://restcountries.eu/rest/v2/all")

In [30]:
cdf = pd.DataFrame(resp.json())

In [31]:
cdf.head()

,alpha2Code,alpha3Code,altSpellings,area,borders,callingCodes,capital,cioc,currencies,demonym,...,name,nativeName,numericCode,population,region,regionalBlocs,subregion,timezones,topLevelDomain,translations
0,AF,AFG,"[AF, Afġānistān]",652230.0,"[IRN, PAK, TKM, UZB, TJK, CHN]",[93],Kabul,AFG,"[{'code': 'AFN', 'name': 'Afghan afghani', 'sy...",Afghan,...,Afghanistan,افغانستان,004,27657145,Asia,"[{'acronym': 'SAARC', 'name': 'South Asian Ass...",Southern Asia,[UTC+04:30],[.af],"{'de': 'Afghanistan', 'es': 'Afganistán', 'fr'..."
1,AX,ALA,"[AX, Aaland, Aland, Ahvenanmaa]",1580.0,[],[358],Mariehamn,,"[{'code': 'EUR', 'name': 'Euro', 'symbol': '€'}]",Ålandish,...,Åland Islands,Åland,248,28875,Europe,"[{'acronym': 'EU', 'name': 'European Union', '...",Northern Europe,[UTC+02:00],[.ax],"{'de': 'Åland', 'es': 'Alandia', 'fr': 'Åland'..."
2,AL,ALB,"[AL, Shqipëri, Shqipëria, Shqipnia]",28748.0,"[MNE, GRC, MKD, KOS]",[355],Tirana,ALB,"[{'code': 'ALL', 'name': 'Albanian lek', 'symb...",Albanian,...,Albania,Shqipëria,008,2886026,Europe,"[{'acronym': 'CEFTA', 'name': 'Central Europea...",Southern Europe,[UTC+01:00],[.al],"{'de': 'Albanien', 'es': 'Albania', 'fr': 'Alb..."
3,DZ,DZA,"[DZ, Dzayer, Algérie]",2381741.0,"[TUN, LBY, NER, ESH, MRT, MLI, MAR]",[213],Algiers,ALG,"[{'code': 'DZD', 'name': 'Algerian dinar', 'sy...",Algerian,...,Algeria,الجزائر,012,40400000,Africa,"[{'acronym': 'AU', 'name': 'African Union', 'o...",Northern Africa,[UTC+01:00],[.dz],"{'de': 'Algerien', 'es': 'Argelia', 'fr': 'Alg..."
4,AS,ASM,"[AS, Amerika Sāmoa, Amelika Sāmoa, Sāmoa Amelika]",199.0,[],[1684],Pago Pago,ASA,"[{'code': 'USD', 'name': 'United State Dollar'...",American Samoan,...,American Samoa,American Samoa,016,57100,Oceania,[],Polynesia,[UTC-11:00],[.as],"{'de': 'Amerikanisch-Samoa', 'es': 'Samoa Amer..."

In [32]:
cdf.describe()

               area        gini    population
count  2.400000e+02  153.000000  2.500000e+02
mean   6.262107e+05   40.177124  2.939655e+07
std    1.950028e+06    9.265119  1.244578e+08
min    4.400000e-01   24.000000  0.000000e+00
25%    1.533250e+03   33.700000  2.029030e+05
50%    7.100650e+04   38.600000  4.648734e+06
75%    4.146432e+05   46.200000  1.803955e+07
max    1.712444e+07   65.800000  1.377422e+09

In [33]:
cdf['population']

0       27657145
1          28875
2        2886026
3       40400000
4          57100
5          78014
6       25868000
7          13452
8           1000
9          86295
10      43590400
11       2994400
12        107394
13      24117360
14       8725931
15       9730500
16        378040
17       1404900
18     161006790
19        285000
20       9498700
21      11319511
22        370300
23      10653654
24         61954
25        775620
26      10985059
27         17408
28       3531159
29       2141206
         ...
220     18564000
221     23503349
222      8593600
223     55155000
224     65327652
225      1167242
226      7143000
227         1411
228       103252
229      1349667
230     11154400
231     78741053
232      4751120
233        31458
234        10640
235     33860700
236     42692393
237      9856000
238     65110000
239    323947000
240      3480222
241     31576400
242       277500
243     31028700
244     92700000
245        11750
246       510713
247     27478000
248     15933883
249     14240168
Name: population, Length: 250, dtype: int64

In [34]:
cdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 24 columns):
alpha2Code        250 non-null object
alpha3Code        250 non-null object
altSpellings      250 non-null object
area              240 non-null float64
borders           250 non-null object
callingCodes      250 non-null object
capital           250 non-null object
cioc              247 non-null object
currencies        250 non-null object
demonym           250 non-null object
flag              250 non-null object
gini              153 non-null float64
languages         250 non-null object
latlng            250 non-null object
name              250 non-null object
nativeName        250 non-null object
numericCode       249 non-null object
population        250 non-null int64
region            250 non-null object
regionalBlocs     250 non-null object
subregion         250 non-null object
timezones         250 non-null object
topLevelDomain    250 non-null object
translations      250 non-null object
dtypes: float64(2), int64(1), object(21)
memory usage: 47.0+ KB

## 11-FEB

In [35]:
# cdf[ ['alpha3Code','name','capital','population','area']].head()
cdf.loc[:5, ['alpha3Code','name','capital','population','area']]

  alpha3Code            name           capital  population       area
0        AFG     Afghanistan             Kabul    27657145   652230.0
1        ALA   Åland Islands         Mariehamn       28875     1580.0
2        ALB         Albania            Tirana     2886026    28748.0
3        DZA         Algeria           Algiers    40400000  2381741.0
4        ASM  American Samoa         Pago Pago       57100      199.0
5        AND         Andorra  Andorra la Vella       78014      468.0

In [ ]:
def get_codes(lst):
    return lst[0]['code']

In [ ]:
c = cdf['currencies'].apply(get_codes).head()

In [ ]:
c

In [ ]:
def get_all_codes(lst):
    codes = []
    for c in lst:
        if 'code' in c and c['code'] is not None:
           codes.append( c['code'])
        
    return ",".join(codes)

In [ ]:
cdf['currencies'].apply(get_all_codes).head(25)

In [ ]:
cdf.loc[8,'currencies']

In [ ]:
cdf.at[8,'currencies']

In [ ]:
cor = 10000000

In [ ]:
cdf[cdf['borders'].str]

In [ ]:
def  has_border(lst):
    return len(lst) > 0

def  has_no_border(lst):
     return  len(lst) == 0

In [ ]:
cdf[cdf['borders'].apply(has_no_border)].head()

In [ ]:
cdf.info()

In [ ]:
cdf['area'].sort_values(ascending=False).head()

In [ ]:
top5 =

In [ ]:
cdf.loc[top5.index,['name','region','area','population']]

In [ ]:
cdf[ (cdf['region'] == 'Asia') & (cdf['area'] > 3000000) ]

In [ ]:
cdf.at[0,'alpha3Code']

In [ ]:
cdf.sample(n=10)

In [ ]:
cdf[ ['name','capital','region']].isin({'region': ['Asia','Africa']})

In [39]:
cdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 24 columns):
alpha2Code        250 non-null object
alpha3Code        250 non-null object
altSpellings      250 non-null object
area              240 non-null float64
borders           250 non-null object
callingCodes      250 non-null object
capital           250 non-null object
cioc              247 non-null object
currencies        250 non-null object
demonym           250 non-null object
flag              250 non-null object
gini              153 non-null float64
languages         250 non-null object
latlng            250 non-null object
name              250 non-null object
nativeName        250 non-null object
numericCode       249 non-null object
population        250 non-null int64
region            250 non-null object
regionalBlocs     250 non-null object
subregion         250 non-null object
timezones         250 non-null object
topLevelDomain    250 non-null object
translations      250 non-null object
dtypes: float64(2), int64(1), object(21)
memory usage: 47.0+ KB

In [48]:
top_den_cl = (cdf['population'] / cdf['area']).sort_values(ascending=False).head()
top_den_cl

131    21636.666667
147    19009.900990
202     7795.774648
101     6634.329710
86      5523.333333
dtype: float64

In [50]:
cdf.loc[top_den_cl.index]

,alpha2Code,alpha3Code,altSpellings,area,borders,callingCodes,capital,cioc,currencies,demonym,...,name,nativeName,numericCode,population,region,regionalBlocs,subregion,timezones,topLevelDomain,translations
131,MO,MAC,"[MO, 澳门, Macao Special Administrative Region o...",30.00,[CHN],[853],,,"[{'code': 'MOP', 'name': 'Macanese pataca', 's...",Chinese,...,Macao,澳門,446,649100,Asia,[],Eastern Asia,[UTC+08:00],[.mo],"{'de': 'Macao', 'es': 'Macao', 'fr': 'Macao', ..."
147,MC,MCO,"[MC, Principality of Monaco, Principauté de Mo...",2.02,[FRA],[377],Monaco,MON,"[{'code': 'EUR', 'name': 'Euro', 'symbol': '€'}]",Monegasque,...,Monaco,Monaco,492,38400,Europe,[],Western Europe,[UTC+01:00],[.mc],"{'de': 'Monaco', 'es': 'Mónaco', 'fr': 'Monaco..."
202,SG,SGP,"[SG, Singapura, Republik Singapura, 新加坡共和国]",710.00,[],[65],Singapore,SIN,"[{'code': 'BND', 'name': 'Brunei dollar', 'sym...",Singaporean,...,Singapore,Singapore,702,5535000,Asia,"[{'acronym': 'ASEAN', 'name': 'Association of ...",South-Eastern Asia,[UTC+08:00],[.sg],"{'de': 'Singapur', 'es': 'Singapur', 'fr': 'Si..."
101,HK,HKG,"[HK, 香港]",1104.00,[CHN],[852],City of Victoria,HKG,"[{'code': 'HKD', 'name': 'Hong Kong dollar', '...",Chinese,...,Hong Kong,香港,344,7324300,Asia,[],Eastern Asia,[UTC+08:00],[.hk],"{'de': 'Hong Kong', 'es': 'Hong Kong', 'fr': '..."
86,GI,GIB,[GI],6.00,[ESP],[350],Gibraltar,,"[{'code': 'GIP', 'name': 'Gibraltar pound', 's...",Gibraltar,...,Gibraltar,Gibraltar,292,33140,Europe,"[{'acronym': 'EU', 'name': 'European Union', '...",Southern Europe,[UTC+01:00],[.gi],"{'de': 'Gibraltar', 'es': 'Gibraltar', 'fr': '..."

In [54]:
nd = pd.DataFrame({'name' : cdf['name'], 'borders' : cdf['borders'].str.join(",")})

In [55]:
nd

,name,borders
0,Afghanistan,"IRN,PAK,TKM,UZB,TJK,CHN"
1,Åland Islands,
2,Albania,"MNE,GRC,MKD,KOS"
3,Algeria,"TUN,LBY,NER,ESH,MRT,MLI,MAR"
4,American Samoa,
5,Andorra,"FRA,ESP"
6,Angola,"COG,COD,ZMB,NAM"
7,Anguilla,
8,Antarctica,
9,Antigua and Barbuda,
10,Argentina,"BOL,BRA,CHL,PRY,URY"
11,Armenia,"AZE,GEO,IRN,TUR"
12,Aruba,
13,Australia,
14,Austria,"CZE,DEU,HUN,ITA,LIE,SVK,SVN,CHE"
15,Azerbaijan,"ARM,GEO,IRN,RUS,TUR"
16,Bahamas,
17,Bahrain,
18,Bangladesh,"MMR,IND"
19,Barbados,
20,Belarus,"LVA,LTU,POL,RUS,UKR"
21,Belgium,"FRA,DEU,LUX,NLD"
22,Belize,"GTM,MEX"
23,Benin,"BFA,NER,NGA,TGO"
24,Bermuda,
25,Bhutan,"CHN,IND"
26,Bolivia (Plurinational State of),"ARG,BRA,CHL,PRY,PER"
27,"Bonaire, Sint Eustatius and Saba",
28,Bosnia and Herzegovina,"HRV,MNE,SRB"
29,Botswana,"NAM,ZAF,ZMB,ZWE"
...,...,...
220,Syrian Arab Republic,"IRQ,ISR,JOR,LBN,TUR"
221,Taiwan,
222,Tajikistan,"AFG,CHN,KGZ,UZB"
223,"Tanzania, United Republic of","BDI,COD,KEN,MWI,MOZ,RWA,UGA,ZMB"
224,Thailand,"MMR,KHM,LAO,MYS"
225,Timor-Leste,IDN
226,Togo,"BEN,BFA,GHA"
227,Tokelau,
228,Tonga,
229,Trinidad and Tobago,
230,Tunisia,"DZA,LBY"
231,Turkey,"ARM,AZE,BGR,GEO,GRC,IRN,IRQ,SYR"
232,Turkmenistan,"AFG,IRN,KAZ,UZB"
233,Turks and Caicos Islands,
234,Tuvalu,
235,Uganda,"COD,KEN,RWA,SSD,TZA"
236,Ukraine,"BLR,HUN,MDA,POL,ROU,RUS,SVK"
237,United Arab Emirates,"OMN,SAU"
238,United Kingdom of Great Britain and Northern I...,IRL
239,United States of America,"CAN,MEX"
240,Uruguay,"ARG,BRA"
241,Uzbekistan,"AFG,KAZ,KGZ,TJK,TKM"
242,Vanuatu,
243,Venezuela (Bolivarian Republic of),"BRA,COL,GUY"
244,Viet Nam,"KHM,CHN,LAO"
245,Wallis and Futuna,
246,Western Sahara,"DZA,MRT,MAR"
247,Yemen,"OMN,SAU"
248,Zambia,"AGO,BWA,COD,MWI,MOZ,NAM,TZA,ZWE"
249,Zimbabwe,"BWA,MOZ,ZAF,ZMB"

In [56]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [62]:
sales.loc[:,['City','Units']].apply(lambda s : s.count())

City     8
Units    8
dtype: int64

In [67]:
sales.applymap(lambda v : 'Null' if v is np.nan else v)

  Month  Book  City  Units
0   JAN  B100   VZG   10.0
1   FEB  B100   VZG    4.0
2   MAR  B100   VZG   13.0
3   JAN  B100   HYD   30.0
4   FEB  B100   HYD   40.0
5   MAR  B100   HYD   10.0
6   JAN  B200   VZG   14.0
7   FEB  B200   HYD    NaN
8   MAR  B200  Null    4.0

In [68]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [69]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
Month    9 non-null object
Book     9 non-null object
City     8 non-null object
Units    8 non-null float64
dtypes: float64(1), object(3)
memory usage: 368.0+ bytes

In [73]:
sales = sales.append( {'Month':'FEB','Book' : 'B300', 'City': 'VZG','Units' : 10}, ignore_index=True)

In [74]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0
9   FEB  B300  VZG   10.0

In [80]:
sales.loc[:5, ['Year']] = 2018

In [78]:
sales['Diff'] = sales['Units'] - 5

In [86]:
sales.drop(['Year','Diff'], axis=1, inplace=True)

In [88]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0
9   FEB  B300  VZG   10.0